
const state = {
  open: 0,
  ifOuterActivity: true,
  outerActivity: [
    {
      id: 'c1',
      name: '名企之路',
      state: false,
      text: [
        '名企职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营',
        '职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营',
        '职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营',
      ],
      cardImgUrl: '../../../../static/images/activity/1.jpeg',
      introImgUrl: [
        '../../../static/images/activity/1.jpeg',
        '../../../static/images/activity/1.jpeg',
      ],
    },
    {
      id: 'c2',
      name: '职场精英训练营',
      state: true,
      text: [
        '职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营',
        '职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营',
        '职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营',
      ],
      cardImgUrl: '../../../../static/images/activity/1.jpeg',
      introImgUrl: [
        '../../../static/images/activity/1.jpeg',
        '../../../static/images/activity/1.jpeg',
      ],
    },
    {
      id: 'c3',
      name: '企业参观',
      state: false,
      text: [
        '职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营',
        '职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营',
        '职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营',
      ],
      cardImgUrl: '../../../../static/images/activity/1.jpeg',
      introImgUrl: [
        '../../../static/images/activity/1.jpeg',
        '../../../static/images/activity/1.jpeg',
      ],
    },
    {
      id: 'c4',
      name: '企业招聘专场',
      state: true,
      text: [
        '职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营',
        '职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营',
        '职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营',
      ],
      cardImgUrl: '../../../../static/images/activity/1.jpeg',
      introImgUrl: [
        '../../../static/images/activity/1.jpeg',
        '../../../static/images/activity/1.jpeg',
      ],
    },
  ],
  innerActivity: [
    {
      id: 'c1',
      name: '管理培训生',
      state: true,
      text: [
        '职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营',
        '职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营',
        '职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营',
      ],
      cardImgUrl: '../../../../static/images/activity/1.jpeg',
      introImgUrl: [
        '../../../static/images/activity/1.jpeg',
        '../../../static/images/activity/1.jpeg',
      ],
    },
    {
      id: 'c2',
      name: '素质拓展',
      state: false,
      text: [
        '职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营',
        '职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营',
        '职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营',
      ],
      cardImgUrl: '../../../../static/images/activity/1.jpeg',
      introImgUrl: [
        '../../../static/images/activity/1.jpeg',
        '../../../static/images/activity/1.jpeg',
      ],
    },
    {
      id: 'c3',
      name: '周年庆',
      state: false,
      text: [
        '职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营',
        '职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营',
        '职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营',
      ],
      cardImgUrl: '../../../../static/images/activity/1.jpeg',
      introImgUrl: [
        '../../../static/images/activity/1.jpeg',
        '../../../static/images/activity/1.jpeg',
      ],
    },
    {
      id: 'c4',
      name: '跨年日租别墅趴',
      state: false,
      text: [
        '职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营',
        '职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营',
        '职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营职场精英训练营',
      ],
      cardImgUrl: '../../../../static/images/activity/1.jpeg',
      introImgUrl: [
        '../../../static/images/activity/1.jpeg',
        '../../../static/images/activity/1.jpeg',
      ],
    },
  ],
};

const mutations = {
  changeActivityType(state, payload) {
    state.ifOuterActivity = payload.ifOuterActivity;
  }
};

const actions = {
  changeActivityType(context, payload) {
    context.commit('changeActivityType', { ...payload });
  }
};

export default {
  namespaced: true,
  state,
  mutations,
  actions,
};
