
const state = {
  title: '浙江大学<br>学生就业与职业发展协会',

  // 协会介绍，一段内容放于数组中成为一项
  description: [
    '打造专业、成熟、真诚服务的精英团队，致力于浙大学子的职业规划和发展，依托浙江大学的名牌效应和人才优势，帮助学生树立正确的职业价值观和职业发展观，搭建学校、学生和企业之间的沟通桥梁，努力为学生拓展职业发展资源，为提升浙大学子竞争力而不懈努力。',
    '打造专业、成熟、真诚服务的精英团队，致力于浙大学子的职业规划和发展，依托浙江大学的名牌效应和人才优势，帮助学生树立正确的职业价值观和职业发展观。',
  ],

  // 三张图，按照上中下排列
  imgUrl: [
    '../../../../static/images/association/1.jpeg',
    '../../../../static/images/association/1.jpeg',
    '../../../../static/images/association/1.jpeg',
  ],
};

export default {
  state,
};
